Repository: mbresson/portfolio
Catalog: core/l10n/*.UTF-8/LC_MESSAGES/default.po
Languages: fr, th

source: Stress was created using Protools and its plugin Xpand2. Most of the work consisted in editing MIDI tracks.
fr: Stress a été créé avec le logiciel Protools et son plugin Xpand2. Le plus gros du travail a consisté à éditer des pistes MIDI.
th: ผมทำ ความเครียด ด้วยโปรแกรม Protools และ Xpand2

source: Listen to Stress:
fr: Écoutez Stress :
th: ลองฟังดู

source: Download the Protools project directory
fr: Téléchargez le répertoire de travail Protools
th: บรรจุลงไฟล์ Protools

source: In Ayutthaya, former capital of a past Siam kingdom
fr: Ayutthaya, capitale d'un ancien royaume de Siam
th: ที่อยุธยา

source: Benchakitti park, Bangkok
fr: Le parc Benchakitti, à Bangkok
th: สวนเบญจกิติ

source: Chiang Mai train station
fr: La station ferroviaire de Chiang Mai
th: สถานีรถไฟที่เชียงใหม่

source: A waterfall near Chiang Rai
fr: Des chutes d'eau non loin de Chiang Rai
th: น้ำตกที่เชียงราย

source: In Krabi town
fr: Dans la ville de Krabi
th: ที่กระบี่

source: In Lumphini park, Bangkok
fr: Dans le parc Lumphini, à Bangkok
th: ที่สวนลุมพินี

source: Floods in the new town of Sukhothai
fr: Inondations dans la nouvelle ville de Sukhothai
th: น้ำท่วมที่สุโขทัย

source: On the banks of the Chao Phraya, Bangkok
fr: Sur les rives de la Chao Phraya, à Bangkok
th: เจ้าพระยา

source: Rama 8 bridge, Bangkok
fr: Le pont Rama 8, à Bangkok
th: สะพานพระราม 8

source: Strolling in Samui
fr: Balade dans Samui
th: เดินเล่นที่เกาะสมุย

source: In Sukhothai historical park
fr: Dans le parc historique de Sukhothai
th: สุโขทัย

source: On the wall of a Buddhist temple: \"Eat to Live, Don't Live to Eat\"
fr: Sur les murs d'un temple bouddhiste : « vivre pour vivre, non pas vivre pour manger »
th: บนกำแพงของวัด

source: The beginning is the most important part of the work
fr: Le commencement est la partie la plus importante du travail
th: การเริ่มต้นเป็นส่วนสำคัญที่สุดของงานที่จะทำ

source: The White Temple, in Chiang Rai
fr: Le temple blanc de Chiang Rai
th: วัดร่องขุ่นที่เชียงราย

source: The White Temple in Chiang Rai, again
fr: Le temple blanc de Chiang Rai
th: วัดร่องขุ่นที่เชียงราย

source: In one word: Thailand.
fr: En un mot : Thaïlande.
th: เมืองไทย

source: Click to open the album viewer
fr: Cliquez pour ouvrir la visionneuse d'images
th: คลิกเพื่อดูทุกรูป

source: Click the cover to enter the album.
fr: Cliquez sur la couverture pour rentrer dans l'album.
th: คลิกรูปเพื่อเข้าในอัลบั้ม

source: Sorry, it seems that your browser is too old to play this audio!
fr: Dommage, il semblerait que votre navigateur soit trop vieux pour jouer cette piste audio !
th: ขอโทษครับ เบราว์เซอร์ของคุณโหลดเสียงไม่ได้

source: What's your name?
fr: Quel est votre nom ?
th: ชื่ออะไรครับ

source: I also need your email address
fr: Puis-je connaître votre adresse email ?
th: ขอที่อยู่อีเมล์ได้ไหมครับ

source: Feel free to express yourself
fr: Exprimez-vous librement
th: บอกอะไรก็ได้ครับ

source: Please answer this math question:
fr: Répondez à cette question de maths :
th: โปรดคำนวณ

source: math question
fr: question de maths
th: คำนวณ

source: Send!
fr: Envoyer !
th: ส่ง

source: Thank you for your message!
fr: Merci pour votre message !
th: ขอบคุณครับที่ส่งข้อความ

source: Sorry, the server isn't responding! Please check your internet connection.
fr: Malheureusement, le serveur ne répond pas ! Pouvez-vous vérifier votre connexion ?
th: ขอโทษครับ ไม่ได้พบเซิร์ฟเรอร์ คุณเชื่อมต่ออินเตอร์เน็ตดีไหมครับ

source: Sorry, it took you too long to send the form! Please refresh the page and try again.
fr: Malheureusement, vous avez été trop long à envoyer le formulaire ! Rafraîchissez la page et essayez une nouvelle fois.
th: ขอโทษครับ ส่งฟอร์มใช้เวลาเยอะเกินไป โปรดลองอีกครั้งครับ

source: Sorry, the message couldn't be sent! I'll address this problem as soon as possible. Thank you for your interest.
fr: Toutes mes excuses, votre message n'a pas pu être envoyé ! Je vais corriger ce problème aussi vite que possible. Je vous remercie de votre intérêt.
th: ขอโทษครับ ไม่ได้ส่งข้อความ ผมจะพยายามซ่อมบั๊กเร็วๆ ขอบคุณครับ

source: Page not found!
fr: Page non trouvée !
th: ไม่พบหน้าที่ต้องการ

source: A Turkish Proverb says:
fr: Un proverbe turque dit :
th: ภาษิตตุรกีบอกว่า

source: Go back home
fr: Retourner à l'accueil
th: กลับหน้าแรก

source: Are you lost? Go back home!
fr: Êtes-vous perdu ? Retournez à l'accueil !
th: หลงทางหรือเปล่า กลับหน้าแรกเถอะ

source: Welcome!
fr: Bienvenue !
th: ยินดีต้อนรับ

source: I am Matthieu Bresson. I'm a self-taught person, passionate about computer science and natural languages. I can dive in a book all day long, or spend hours tinkering with my GNU/Linux system. Although I was born and raised in France, I intend to work and settle abroad.
fr: Je suis Matthieu Bresson. Je suis un autodidacte passionné par l'informatique et les langues. Je peux me perdre dans un livre pour la journée, ou passer des heures à bidouiller mon système GNU/Linux. Bien que je sois né en France, mon objectif est de m'installer et de travailler à l'étranger.
th: ผมชื่อ มาตติเออ เบรสซง ผมเป็นคนที่ชอบเรียนด้วยตัวเอง หลงใหลคอมพิวเตอร์และภาษา ชอบอ่านหนังสือตลอดวันหรือทำนู่นทำนี่กับระบบ ลินุกซ์ แม้ว่าผมเกิดที่ประเทศฝรั่งเศส แต่ผมตั้งใจว่าจะทำงานและย้ายไปอยู่ต่างประเทศ

source: The emblem of my website is a pathway through the woods, because life is a long and complicated path we must all walk. It's fine, I love strolling.
fr: Le symbole de mon site est un sentier forestier, parce que la vie est un chemin long et sinueux que nous devons tous arpenter. Peu m'importe, j'aime les balades !
th: โลโก้ของเว็บไซต์เป็นทางเดินในป่าเพราะชีวิตเป็นทางเดินที่ยาวและซับซ้อน ไม่เป็นไร ผมชอบเดินเล่น

source: Enjoy your visit!
fr: Bonne exploration !
th: ขอให้มีความสุขกับการชมเว็บไซต์ครับ

source: %from% says:
fr: %from% dit :
th: %from%บอกว่า

source: License: %license_link%
fr: Licence : %license_link%
th: สิทธิการใช้งาน: %license_link%

source: A few screenshots:
fr: Quelques aperçus :
th: รูปๆ

source: All categories
fr: Toute catégorie
th: ทุกชนิด

source: All work contexts
fr: Tout contexte
th: ทำทุกที่

source: Personal projects
fr: Projets personnels
th: ทำเอง

source: School projects
fr: Projets scolaires
th: ทำที่มหาลัย

source: No results!
fr: Aucun résultat !
th: ไม่มีอะไร

source: Blog
th: บล็อก

source: Contact
th: ติดต่อ

source: Gandalf
th: แกนดัล์ฟ

source: Laos 2013
th: ประเทศลาว 2556

source: Berlin 2014
th: เบอร์ลิน 2557

source: France
th: ประเทศฝรั่งเศส

source: Stress
th: ความเครียด

source: Luang Prabang
th: หลวงพระบาง

source: Ayutthaya
th: ที่อยุธยา

source: Menu
th: เมนู
