Repository: mbresson/portfolio
Catalog: core/l10n/*.UTF-8/LC_MESSAGES/default.po
Languages: fr, th

source: Home
fr: Accueil
th: หน้าแรก

source: Works
fr: Travaux
th: ผลงาน

source: Work
fr: Travail
th: ผลงาน

source: Résumé
fr: CV
th: ประวัติย่อ

source: No matter how far down the wrong road you've gone, turn back.
fr: Peu importe jusqu'à quel point tu as avancé sur le mauvais chemin, fais demi-tour.
th: ไม่ว่าจะเดินผิดทางมาไกลแค่ไหน ก็ยังหันหลังกลับมาได้เสมอ

source: A Turkish proverb
fr: Un proverbe turque
th: ภาษิตตุรกี

source: Many that live deserve death. And some that die deserve life. Can you give it to them? Then do not be too eager to deal out death in judgement.
fr: Nombreux sont les vivants qui mériteraient la mort, et les morts qui mériteraient la vie, pouvez-vous la leur rendre Frodon ? Alors ne soyez pas trop prompt à dispenser morts et jugements.
th: หลายชีวิตสมควรตาย และหลายชีวิตที่ตายสมควรอยู่ เจ้าคืนชีวิตให้พวกเขาได้ไหมล่ะ จงอย่าคิดตัดสินชะตาชีวิตใครต่อใครดีกว่า

source: The beginning is the most important part of the work.
fr: Le commencement est la partie la plus importante du travail.
th: การเริ่มต้นเป็นส่วนสำคัญที่สุดของงานที่จะทำ

source: Plato
fr: Platon
th: เพลโต

source: Programming
fr: Développement
th: โปรแกรมมิง

source: Software and website development.
fr: Développement de programmes et de sites web.
th: โปรแกรมและเว็บไซต์

source: Artistic
fr: Artistique
th: ศิลปะ

source: Artistic works (images, music, etc).
fr: Travaux artistiques (images, sons, etc).
th: งานศิลปะ (รูป เสียง ฯลฯ)

source: Photo albums
fr: Albums photos
th: อัลบั้มรูป

source: Photos from trips and everyday life.
fr: Des photos de voyages et de la vie quotidienne.
th: รูปที่ถ่ายเวลาเที่ยวหรือในชีวิตประจำวัน

source: Miscellaneous
fr: Autres
th: อื่นๆ

source: Other works...
fr: Autres travaux...
th: ผลงานอื่นๆ

source: A highly configurable Tetris clone
fr: Un clone du jeu Tetris ultra-configurable
th: เกมเตตริส

source: A mix between Ping Pong and Bricks Breaking games
fr: Un mélange de Ping Pong et de Casse-Briques
th: เกมทำลายอิฐผสมปิงปอง

source: A very basic C library for the handling of polynomials
fr: Une bibliothèque C pour gérer les polynômes
th: ไลบรารี่ภาษาซีสำหรับพหุนาม

source: A photo sharing website
fr: Un site web de partage de photos
th: เว็บไซต์แลกเปลี่ยนรูป

source: A theme for PluXML blogs
fr: Un thème pour les blogs fonctionnant avec PluXML
th: ธีมสำหรับบล็อกที่สร้างด้วย PluXML

source: My portfolio website which you're currently browsing!
fr: Mon site web sur lequel vous êtes en ce moment !
th: เว็บไซต์ที่คุณกำลังอ่านอยู่

source: The website of Moonlight Champa guesthouse, Vientiane, Lao PDR
fr: Le site web de Moonlight Champa, une maison d'hôtes à Vientiane, Laos
th: เว็บไซต์สำหรับเกสต์เฮ้าส์ Moonlight Champa ที่เวียงจันทน์

source: Photos shot in Vientiane and Luang Prabang, Lao PDR
fr: Photos prises à Vientiane et Luang Prabang, Laos
th: รูปที่ถ่ายที่เวียงจันทน์และหลวงพระบาง

source: Korea 2012
fr: Corée du sud, 2012
th: ประเทศเกาหลี 2555

source: Photos shot in South Korea during my summer school at Chonbuk National University
fr: Photos prises en Corée du sud pendant mon séjour à Chonbuk National University
th: รูปที่ถ่ายที่ประเทศเกาหลีใต้เวลาอยู่ที่ Chonbuk National University

source: Beijing 2013
fr: Pékin, 2013
th: ปักกิ่ง 2556

source: Photos shot when doing a four-month internship in Beijing
fr: Photos prises à l'occasion d'un stage de quatre mois à Pékin
th: รูปที่ถ่ายที่ปักกิ่ง

source: Photos shot during a short trip to Berlin
fr: Photos prises pendant un court voyage à Berlin
th: รูปที่ถ่ายที่เบอร์ลิน

source: Photos shot over the years in France
fr: Photos prises en France tout au long des dernières années
th: รูปที่ถ่ายที่ประเทศฝรั่งเศส

source: Thailand 2014
fr: Thaïlande, 2014
th: เมืองไทย 2557

source: Photos shot in Thailand in 2014
fr: Photos prises en Thaïlande en 2014
th: รูปที่ถ่ายที่เมืองไทยในปี 2557

source: Other pictures
fr: Autres photos
th: รูปอื่นๆ

source: Miscellaneous pictures
fr: Des photos diverses et variées
th: รูปอื่นๆ

source: A short audio work trying to depict the rise of stress
fr: Un court travail musical essayant de décrire la montée du stress
th: เพลงสั้นเรื่องความเครียด

source: Apartom
fr: Séparatome

source: A picture about a man and a woman who are apart even though they're sitting close to each other
fr: Une image au sujet d'un homme et d'une femme séparés malgré leur proximité physique
th: รูปเรื่องผู้ชายและผู้หญิงที่ไกลกันมากแม้ว่านั่งใกล้ๆกัน

source: Blazon
fr: Blason
th: ตรา

source: A visual description of my values and my roots
fr: Une description visuelle de mes valeurs et de mes racines

source: Schwann internship report
fr: Rapport de stage Schwann
th: รายงานการฝึกงานที่Schwann

source: A report on my four-month internship at Schwann
fr: Un rapport sur mon stage de quatre mois à Schwann
th: รายงานการฝึกงานสี่เดือนที่Schwann

source: Overhaul plan for Soleilprod
fr: Plan de refonte de Soleilprod
th: แผนยกเครื่องเว็บไซต์ Soleilprod

source: An overhaul plan for soleilprod.com website
fr: Un plan de refonte du site soleilprod.com
th: แผนยกเครื่องเว็บไซต์ soleilprod.com

source: After a teacher showed me the video of the encounter of artists Marina Abramović and Ulay in 2010, he asked me to make some visual work to express how I felt about this moment. I decided to depict them like two heaps of geometric shapes (triangles and circles) because I have the feeling that at the smallest scale, every human being is a heap of atoms, and our emotions are dictated by a set of chimical reactions and by the brain.
fr: Après qu'un professeur m'ait montré une vidéo de la rencontre des artistes Marina Abramović et Ulay en 2010, il m'a demandé de réaliser une illustration pour exprimer mon ressenti. J'ai décidé de montrer les deux artistes comme deux amas de formes géométriques (des triangles et des cercles) car j'avais la conviction qu'à la plus petite échelle, tout être humain se réduit à un tas d'atomes, et que nos émotions étaient dictées par un ensemble de réactions chimiques et par le cerveau.

source: Check out the video of Abramović and Ulay on Youtube
fr: Regardez la vidéo d'Abramović et Ulay sur Youtube
th: ดูวิดีโอเรื่อง Abramović และ Ulay บน Youtube

source: A level in Arkanopong
fr: Un niveau dans Arkanopong
th: กำลังเล่น Arkanopong อยู่

source: The main menu allows you to change some settings and to select the level to play
fr: Le menu principal permet de faire certains réglages et de choisir le niveau à jouer
th: หน้าแรกมีหลายตัวเลือก

source: Arkanopong is a mix between Ping Pong and Bricks Breaking games. You can play with another human or against the computer (its IA is basic but does the job).
fr: Arkanopong est un mélange de Ping Pong et de Casse-Briques. Vous pouvez jouer avec un autre humain ou contre la machine (son intelligence est basique mais suffisante pour perdre face à elle).
th: เกมทำลายอิฐผสมปิงปอง เล่นกับคนอื่นหรือคอมพิวเตอร์ได้

source: Arkanopong uses OpenGL 2 and its fixed function pipeline for the rendering. It may run on any platform supported by OpenGL2 and the SDL library (which is used to create the window and capture events).
fr: Arkanopong utilise OpenGL 2 et son pipeline de rendu fixe. Il peut fonctionner sur n'importe quelle plate-forme qui supporte OpenGL 2 et la bibliothèque SDL (utilisée pour le fenêtrage et la gestion des événements).
th: Arkanopong ใช้ไลบรารี่ OpenGL 2 และ SDL

source: This project was fun to work on but if I could re-write it, I'd do it differently. The biggest difficulty I ran into was to render text. At first, I intended to render the text with Freetype library, but due to the strict deadline I didn't have time to learn how to use it. In the end, since all the text in the game is fixed and never changes, I chose to render it with SDL_image and then convert it to hardware textures.
fr: Ce projet était amusant à réaliser mais si je pouvais le réécrire de zéro, je le développerais différemment. Ma plus grosse difficulté fut de rendre du texte à l'écran. Initialement, je souhaitais utiliser la bibliothèque Freetype, mais en raison de la deadline toute proche, je n'ai pas eu le temps de m'y former. J'ai donc finalement choisi de rendre le texte avec SDL_image et de le convertir en textures pour la carte graphique, car le texte n'a pas besoin de changer en fonction des interactions du joueur.
th: เวลาผมทำโปรเจคนี้ผมสนุก แต่ตอนนี้ผมไม่พอใจเรื่องคุณภาพของโค้ดแล้ว ถ้าจะต้องเขียนโค้ดครั้งใหม่ ผมจะทำอย่างอื่น

source: C programming language
fr: Langage C
th: ภาษาซี

source: SDL library
fr: Bibliothèque SDL
th: ไลบรารี่ SDL

source: Download the source code of Arkanopong
fr: Téléchargez le code source d'Arkanopong
th: บรรจุลงโค้ดของ Arkanopong

source: Download the work report I had to write for my teacher (it's only in French)
fr: Téléchargez le rapport de fin de projet qu'il m'a fallu écrire pour mon enseignant
th: บรรจุลงรายงานโปรเจค(เป็นภาษาฝรั่งเศส)

source: Bareview on my old blog
fr: Bareview habillant mon ancien blog
th: Bareview ที่บล็อกเก่าของผม

source: Bareview is a theme for the blog engine Pluxml 5.1. It was designed to give a feeling of "straight to the point".
fr: Bareview est un thème pour PluXML 5.1. Il a été pensé pour donner une impression de « droit au but ».
th: Bareview เป็นธีมสำหรับบล็อกซอฟต์แวร์ PluXML 5.1.

source: I created it to provide a more personal look to my old blog. I no longer use it nor maintain it.
fr: Je l'ai créé pour donner un feeling plus personnel à mon ancien blog. Je ne l'utilise ni ne le maintiens plus.

source: Download the source code of Bareview
fr: Téléchargez le code source de Bareview
th: บรรจุลงโค้ดของ Bareview

source: Chaoyang park, Beijing
fr: Le parc Chaoyang, à Pékin
th: สวน Chaoyang ที่ปักกิ่ง

source: Mind your step in the Forbidden City
fr: « Mind your step » dans la Cité Interdite
th: \"Mind your step\" ในพระราชวังต้องห้าม

source: Near the Jinshanling section of the Great Wall
fr: Près de la Muraille de Chine à Jinshanling
th: ใกล้ๆกำแพงเมืองจีนที่ Jinshanling

source: The Great Wall of Mutianyu
fr: La Muraille de Chine à Mutianyu
th: กำแพงเมืองจีนที่ Mutianyu

source: Children in primary school gather in the early morning
fr: Enfants rassemblés dans la cour de leur école, un matin
th: เด็กๆข้างนอกโรงเรียนตอนเช้า

source: I spent four months in Beijing when I did an internship there in 2013. I had the opportunity to visit many places (the Great Wall, the Forbidden City, many parks...).
fr: J'ai passé quatre mois à Pékin à l'occasion de mon stage de 2013. J'ai eu l'opportunité de visiter de nombreux lieux (Grande Muraille, Cité Interdite, de nombreux parcs).
th: ผมอยู่ที่ปักกิ่งสี่เดือนเวลาฝึกงานในปี2556 ผมได้ไปเที่ยวที่ที่เยอะๆ เช่น กำแพงเมืองจีน พระราชวังต้องห้าม สวน และอื่นๆ

source: Alexanderplatz subway station
fr: Station de métro d'Alexanderplatz
th: สถานีรถไฟใต้ดิน Alexanderplatz

source: Brandenburg gate
fr: La porte de Brandebourg
th: ประตูบรันเดนบูร์ก

source: Holocaust Memorial
fr: Le mémorial de la Shoah
th: อนุสรณ์สถานฮอโลคอสต์

source: Natural History Museum
fr: Le musée national d'Histoire naturelle
th: พิพิธภัณฑ์ประวัติศาสตร์ธรรมชาติ

source: The Reichstag
fr: Le Reichstag
th: Reichstag

source: The river Spree
fr: La rivière Spree
th: แม่น้ำ Spree

source: Berlin is famous for its street art
fr: Berlin est fameux pour son art mural
th: ศิลปะกำแพงที่เบอร์ลิน

source: Tempelhof Feld, an airport turned into a vast public park
fr: Tempelhof Feld, un aéroport reconverti en un vaste parc public
th: สวนสาธารณะ Tempelhof Feld เคยเป็นสนามบิน

source: Photos of a short trip in Berlin.
fr: Photos d'un court voyage à Berlin.
th: รูปที่ถ่ายเวลาไปเที่ยวที่เบอร์ลินสามสี่วัน

source: A few years ago, a teacher asked me to produce a blazon that would represent my values. This blazon represents my will to thrive. The different parts symbolize the body and the mind, both of which are the vital material for life.
fr: Il y a quelques années, un professeur m'a demandé de créer un blason qui représenterait mes valeurs. Ce blason représente mon désir d'aller toujours plus loin. Les différentes parties symbolisent le corps et l'esprit, qui sont tous deux nécessaires à la vie.

source: Blockmatic after some tweaking
fr: Blockmatic après un peu de configuration
th: กำลังเล่น Blockmatic อยู่

source: Blockmatic when paused
fr: Blockmatic en pause
th: Blockmatic หยุดชั่วคราว

source: Blockmatic is a highly configurable Tetris clone. You can tweak it via the command line interface (blockmatic --help for the list of all available options).
fr: Blockmatic est un clone du jeu Tetris ultra-configurable. Vous pouvez le configurer via la ligne de commande (blockmatic --help donne la liste de toutes les options).
th: Blockmatic เป็นเกมเตตริสที่ปรับได้ด้วยบรรทัดคำสั่ง(blockmatic --help ช่วยได้)

source: I'm an unconditional fan of Tetris and I wanted to have a game that I could adapt to my needs. It was also a great opportunity to discover the SDL2 library for game development.
fr: Je suis un fan inconditionnel du jeu Tetris et je voulais avoir un jeu que je puisse adapter en fonction de mes goûts. Ce fut aussi l'opportunité de découvrir la bibliothèque SDL2 pour le développement de jeux.
th: ผมทำ Blockmatic เพราะติดเกมเตตริสและอยากทำโปรเจคที่ใช้ไลบรารี่ SDL2

source: SDL2 library
fr: Bibliothèque SDL2
th: ไลบรารี่ SDL2

source: Download the source code of Blockmatic
fr: Téléchargez le code source de Blockmatic
th: บรรจุลงโค้ดของ Blockmatic

source: Download Blockmatic for Windows
fr: Téléchargez Blockmatic pour Windows
th: บรรจุลง Blockmatic สำหรับวินโดวส์

source: Download Blockmatic for Linux (32 bits)
fr: Téléchargez Blockmatic pour Linux (32 bits)
th: บรรจุลง Blockmatic สำหรับลีนุกซ์(32บิต)

source: Download Blockmatic for Linux (64 bits)
fr: Téléchargez Blockmatic pour Linux (64 bits)
th: บรรจุลง Blockmatic สำหรับลีนุกซ์(64บิต)

source: A user's album page, with sorting buttons and pagination controls
fr: La page d'album d'un utilisateur, avec des boutons pour trier les photos et pour passer d'une page à une autre
th: เพจอัลบั้ม

source: Demoshot is a photo sharing website. Its users can (after signing up) upload photos, give marks and comment on other people's pictures. The photos can be associated with tags and easily managed in each user's album. Demoshot's UI is built upon Twitter Bootstrap. The underlying database management system is MySQL.
fr: Demoshot est un site de partage de photos. Les utilisateurs peuvent (une fois enregistrés) publier des photos, mettre des notes et des commentaires sur les photos des autres. Les photos peuvent être associées à des tags et facilement gérées dans la page d'album de chaque utilisateur. L'interface de Demoshot est bâtie sur Twitter Bootstrap. Le SGBD utilisé est MySQL.
th: Demoshot เป็นเว็บไซต์แลกเปลี่ยนรูป ผู้ใช้อัพโหลดรูปและเขียนความเห็นเรื่องรูปของผู้ใช้คนอื่นได้ Demoshot สร้างด้วย PHP และ MySQL

source: During my second year of undergraduate studies, the PHP teacher asked the students to develop a photo sharing website from scratch. Back then I was not very comfortable with PHP. As a result, it is not a project I'm very proud to show: the overall architecture is messy and the code itself is not a pleasant read, even though it's commented. However, I'm proud that I was able to develop my first complete website in a short time and all by myself. I have learnt a lot thanks to it.
fr: Pendant ma seconde année de DUT, mon professeur de PHP demanda aux étudiants de développer un site de partage de photos en partant de zéro. À l'époque, je n'étais pas encore très à l'aise avec PHP. C'est pourquoi ce n'est pas un projet que je suis très fier de montrer : l'architecture générale est médiocre et le code n'est pas très plaisant à lire malgré les commentaires. Cependant, je suis fier d'avoir été capable de développer mon premier site complet en un court temps et par moi-même. Cela m'a permis d'apprendre beaucoup.
th: Demoshot เป็นโปรเจคเก่า เพราะเวลาสร้างผมยังรู้ภาษา PHP ไม่มาก ผมจึงไม่พอใจเรื่องคุณภาพของโค้ดแล้ว แต่ก็ยังพอใจที่ได้สร้างเว็บไซต์นี้คนเดียว

source: Download the source code of Demoshot
fr: Téléchargez le code source de Demoshot
th: บรรจุลงโค้ดของ Demoshot

source: Check out the demo
fr: Testez la démo
th: เข้าดู

source: Winter is coming
fr: L'Hiver vient

source: Beyond the grid
fr: Au-delà de la grille

source: This is a collection of photos I have taken over the past years. From time to time, I notice something beautiful or weird, and I do my best to capture it.
fr: Il s'agit d'une collection de photos prises tout au long des dernières années. Occasionnellement, je remarque quelque chose de magnifique ou d'étrange et je tente de le capturer.
th: รูปที่ถ่ายหลายปีแล้ว บางทีผมได้เห็นสิ่งที่สวยหรือแปลกที่น่าถ่าย

source: Taking a bus from Incheon airport
fr: Dans un bus de l'aéroport d'Incheon
th: ในรถทัวร์ของสนามบินอินชอน

source: In 2012, I had the opportunity to visit Korea and attend a summer school for three weeks in %s. During my stay, I took a lot of photos, but I decided only to select a few interesting ones for this album.
fr: En 2012, j'ai eu l'opportunité de visiter la Corée du sud et d'assister à des cours d'été pour trois semaines à %s. Pendant mon séjour, j'ai pris de nombreuses photos, mais j'ai décidé de n'en retenir qu'une petite partie.
th: ผมไปเที่ยวที่ประเทศเกาหลีใต้และเรียนที่ %s สามอาทิตย์ในปี2555

source: Visit the website of Chonbuk National University
fr: Visiter le site web de Chonbuk National University
th: เข้าดูเว็บไซต์ของ Chonbuk National University

source: In Buddha park, near Vientiane
fr: Buddha Park, près de Vientiane
th: สวนพระ ใกล้ๆเวียงจันทน์

source: The emblem of Laos
fr: L'emblème du Laos
th: ตราของประเทศลาว

source: Strolling in Luang Prabang
fr: Balade dans Luang Prabang
th: เดินเล่นที่หลวงพระบาง

source: The Mekong in the morning
fr: Le Mékong de bon matin
th: แม่น้ำโขงตอนเช้า

source: Nam Phou fountain, Vientiane.
fr: La fontaine de la place Nam Phou, à Vientiane.
th: น้ำพุที่เวียงจันทน์

source: The Patuxai (victory monument), Vientiane.
fr: Le Patuxay (arche de triomphe) à Vientiane.
th: ประตูชัยที่เวียงจันทน์

source: In Pha That Luang, Vientiane.
fr: À Pha That Luang, Vientiane
th: พระธาตุหลวงที่เวียงจันทน์

source: In 2013, I explored two cities in Laos: Vientiane and Luang Prabang.
fr: En 2013, j'ai exploré deux villes du Laos : Vientiane et Luang Prabang.
th: ในปี2556ผมไปเที่ยวที่เวียงจันทน์และหลวงพระบาง

source: The home page of Moonlight Champa
fr: La page d'accueil de Moonlight Champa
th: หน้าแรกของเว็บไซต์

source: A page listing all available rooms and their rates
fr: Une page listant toutes leurs chambres et les tarifs associés
th: ห้องนอนและราคา

source: Moonlight Champa is a guesthouse in Vientiane, Lao PDR. This website aims at attracting travelers and allows them to book a room.
fr: Moonlight Champa est une maison d'hôtes à Vientiane, au Laos. Ce site a pour objectif d'attirer les voyageurs et leur permet de faire une demande de chambre.
th: Moonlight Champa เป็นเกส์ตเฮาส์ที่เวียงจันทน์ เว็บไซต์นี้สำหรับนักท่องเที่ยวที่หาเกส์ตเฮาส์และอาจจะจองห้องนอน

source: Moonlight Champa is built on top of Slim (a PHP micro-framework). I developed a first version of the website in 2013, then I created a second version during summer 2014 and made it responsive to enhance the experience of smartphone users.
fr: Le site de Moonlight Champa est construit sur Slim (un micro-framework en PHP). J'ai développé une première version du site en 2013, puis j'ai créé une seconde version pendant l'été 2014 et l'ai rendue responsive pour améliorer l'expérience des utilisateurs de smartphones.
th: Moonlight Champa สร้างด้วย Slim Framework (ไลบรารี่ PHP) ผมสร้างเว็บไซต์แรกในปี2556แล้วสร้างเว็บไซต์ที่สองในฤดูร้อนปี2557

source: I created this website for my friends who own the guesthouse, and because it is an awesome place to stay, when visiting Vientiane.
fr: J'ai créé ce site web pour mes amis propriétaires de Moonlight Champa, et parce que c'est l'endroit parfait pour se poser, quand on visite Vientiane.
th: ผมสร้างเว็บไซต์นี้สำหรับเพื่อนที่เป็นเจ้าของเกส์ตเฮาส์และเพราะที่นั้นคงคือเกส์ตเฮาส์ที่สบายที่สุดที่เวียงจันทน์

source: Check it out!
fr: Jetez un œil !
th: เข้าดู

source: Do you recognize this photo? Can you find its twin in another album?
fr: Avez-vous reconnu cette photo ? Pouvez-vous retrouver sa jumelle dans un autre album ?
th: รู้จักรูปนี้หรอ อัลบั้มอื่นมีรูปที่คล้ายมันมาก ลองหาดูนะ

source: In this album, you will find pictures that didn't belong to any other album.
fr: Dans cet album, vous trouverez des photos à part.
th: อัลบั้มนี้มีรูปที่เข้ากับรูปอื่นไม่ได้

source: Polynomials is a basic C library for polynomials arithmetic. It is not optimized and only provides the most basic operations (evaluating a polynomial, derivating it).
fr: Polynomials est une bibliothèque C pour faire des maths polynomiales. Elle n'est pas du tout optimisée et implémente seulement des opérations les plus basiques (évaluer un polynôme, calculer sa dérivée).
th: Polynomials เป็นไลบรารี่ภาษาซีสำหรับพหุนาม มันไม่เร็วและมีฟีเจอร์ไม่เยอะ

source: It is plain C (a C99-friendly compiler is required) and doesn't require any third-party library.
fr: Le code est écrit en C (un compilateur C99 est nécessaire) et ne requière aucune bibliothèque externe.
th: มันเขียนเป็นภาษาซี ไม่ต้องการสักไลบรารี่

source: Download the source code of Polynomials
fr: Téléchargez le code source de Polynomials
th: บรรจุลงโค้ดของ Polynomials

source: Does it feel familiar?
fr: Est-ce que ça semble familier ?
th: รู้จักหรอ

source: This is my personal website.
fr: Mon site personnel.
th: มันคือเว็บไซต์ของผม

source: This is a report about my four-month internship in Beijing, from April to July 2013. I was a web developer intern at %s.
fr: Il s'agit d'un rapport sur mon stage de quatre mois à Pékin, d'avril à juillet 2013, alors que j'étais stagiaire développeur web à %s.
th: มันเป็นรายงานเรื่องการฝึกงานสี่เดือนที่ปักกิ่งตั้งแต่เมษายนถึงกรกฎาคมในปี2556 ผมเคยเป็นนักพัฒนาเว็บที่ %s.

source: Visit the website of Schwann
fr: Visiter le site de Schwann
th: เข้าดูเว็บไซต์ของ Schwann

source: Schwann web agency
fr: l'agence web Schwann

source: Download the report (only in French)
fr: Téléchargez le rapport de stage
th: บรรจุลงรายงาน(เป็นภาษาฝรั่งเศส)

source: Soleil is a big French comic book publisher. This document describes a detailed overhaul plan for %s. It contains a study of their current website and their concurrents, and models for a new website. The work was done in team with Juliette Belin, Alice Neichols and Andréas Pinbouen. The design of the document was done by Andréas Pinbouen.
fr: Soleil est un gros éditeur de bande-dessinée française. Ce document détaille un plan de refonte pour %s. Il contient une étude de leur site actuel et de leurs concurrents, et des mockups pour un nouveau site web. Il s'agissait d'un travail de groupe avec Juliette Belin, Alice Neichols et Andréas Pinbouen. La mise en page du document a été faite par Andréas Pinbouen.

source: Visit the website of Soleil
fr: Visitez le site de Soleil
th: เข้าดูเว็บไซต์ของ Soleil

source: Soleil's website
fr: le site web de Soleil
th: เว็บไซต์ของ Soleil

source: Download the document (only in French)
fr: Téléchargez le document
th: บรรจุลงรายงาน(เป็นภาษาฝรั่งเศส)

source: Stress is an attempt to create a short (2-minute-long) music about stress and losing control. The music consists of three parts: the rise of stress, an attempt to cool down and lastly, the failure and the final collapse.
fr: Stress est une tentative pour créer une courte musique (longue de deux minutes) au sujet du stress et de la perte de ses nerfs. La musique est en trois parties : la montée du stress, un effort pour se calmer et échapper à l'angoisse, puis l'échec et le final.
